{
    "EPOCHS": 500,
    "STOPPED_EPOCH": 141,
    "BEST_VAL_LOSS": 0.02373,
    "BATCH_SIZE": 1024,
    "LEARNING_RATE": 0.001,
    "TEST_LOSS": 0.02349,
    "TEST_MAE": 0.10131,
    "OPTIMIZER": "{'name': 'RMSprop', 'learning_rate': 0.001, 'decay': 0.0, 'rho': 0.9, 'momentum': 0.0, 'epsilon': 1e-07, 'centered': False}",
    "MODEL_ARCHITECTURE":{
        "class_name": "Functional",
        "config": {
            "name": "model_3",
            "layers": [
                {
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            18,
                            1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_1"
                    },
                    "name": "input_1",
                    "inbound_nodes": []
                },
                {
                    "class_name": "Conv1D",
                    "config": {
                        "name": "conv1d",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 256,
                        "kernel_size": [
                            3
                        ],
                        "strides": [
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "conv1d",
                    "inbound_nodes": [
                        [
                            [
                                "input_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "MaxPooling1D",
                    "config": {
                        "name": "max_pooling1d",
                        "trainable": true,
                        "dtype": "float32",
                        "strides": [
                            2
                        ],
                        "pool_size": [
                            2
                        ],
                        "padding": "same",
                        "data_format": "channels_last"
                    },
                    "name": "max_pooling1d",
                    "inbound_nodes": [
                        [
                            [
                                "conv1d",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Conv1D",
                    "config": {
                        "name": "conv1d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 128,
                        "kernel_size": [
                            3
                        ],
                        "strides": [
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "conv1d_1",
                    "inbound_nodes": [
                        [
                            [
                                "max_pooling1d",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "MaxPooling1D",
                    "config": {
                        "name": "max_pooling1d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "strides": [
                            2
                        ],
                        "pool_size": [
                            2
                        ],
                        "padding": "same",
                        "data_format": "channels_last"
                    },
                    "name": "max_pooling1d_1",
                    "inbound_nodes": [
                        [
                            [
                                "conv1d_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "LSTM",
                    "config": {
                        "name": "lstm",
                        "trainable": true,
                        "dtype": "float32",
                        "return_sequences": true,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false,
                        "time_major": false,
                        "units": 128,
                        "activation": "tanh",
                        "recurrent_activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "shared_object_id": 9
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1.0,
                                "seed": null
                            },
                            "shared_object_id": 10
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {},
                            "shared_object_id": 11
                        },
                        "unit_forget_bias": true,
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0.0,
                        "recurrent_dropout": 0.0,
                        "implementation": 2
                    },
                    "name": "lstm",
                    "inbound_nodes": [
                        [
                            [
                                "max_pooling1d_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "LSTM",
                    "config": {
                        "name": "lstm_1",
                        "trainable": true,
                        "dtype": "float32",
                        "return_sequences": false,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false,
                        "time_major": false,
                        "units": 64,
                        "activation": "tanh",
                        "recurrent_activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "shared_object_id": 14
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1.0,
                                "seed": null
                            },
                            "shared_object_id": 15
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {},
                            "shared_object_id": 16
                        },
                        "unit_forget_bias": true,
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0.0,
                        "recurrent_dropout": 0.0,
                        "implementation": 2
                    },
                    "name": "lstm_1",
                    "inbound_nodes": [
                        [
                            [
                                "lstm",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "name": "dense",
                    "inbound_nodes": [
                        [
                            [
                                "lstm_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_1",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense",
                    0,
                    0
                ]
            ]
        },
        "keras_version": "2.10.0",
        "backend": "tensorflow"
    }
}