{
    "EPOCHS": 500,
    "STOPPED_EPOCH": 259,
    "BEST_VAL_LOSS": 0.02917,
    "BATCH_SIZE": 1024,
    "LEARNING_RATE": 0.001,
    "TEST_LOSS": 0.02765,
    "TEST_MAE": 0.11176,
    "MODEL_ARCHITECTURE": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_15",
            "layers": [
                {
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            18,
                            1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "conv1d_14_input"
                    }
                },
                {
                    "class_name": "Conv1D",
                    "config": {
                        "name": "conv1d_14",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            18,
                            1
                        ],
                        "dtype": "float32",
                        "filters": 128,
                        "kernel_size": [
                            3
                        ],
                        "strides": [
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten_12",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_36",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1024,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "RandomUniform",
                            "config": {
                                "minval": -0.05,
                                "maxval": 0.05,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_24",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "BatchNormalization",
                    "config": {
                        "name": "batch_normalization_24",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                            1
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "gamma_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "moving_mean_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "moving_variance_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_37",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 512,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "RandomUniform",
                            "config": {
                                "minval": -0.05,
                                "maxval": 0.05,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_25",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "BatchNormalization",
                    "config": {
                        "name": "batch_normalization_25",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                            1
                        ],
                        "momentum": 0.99,
                        "epsilon": 0.001,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "gamma_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "moving_mean_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "moving_variance_initializer": {
                            "class_name": "Ones",
                            "config": {}
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_38",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }
            ]
        },
        "keras_version": "2.10.0",
        "backend": "tensorflow"
    }
}